@evertsd 
hello
yes it is in the state.
But when i run the plan it say it create a new one :

# mongodbatlas_network_peering.mongo_peer["vpc_peer_dev"] will be created
  + resource "mongodbatlas_network_peering" "mongo_peer" {
      + accepter_region_name   = "eu-west-3"
      + atlas_cidr_block       = (known after apply)
      + atlas_gcp_project_id   = (known after apply)
      + atlas_id               = (known after apply)
      + atlas_vpc_name         = (known after apply)
      + aws_account_id         = "XXX"
      + azure_directory_id     = (known after apply)
      + azure_subscription_id  = (known after apply)
      + connection_id          = (known after apply)
      + container_id           = "XXXX"
      + error_message          = (known after apply)
      + error_state            = (known after apply)
      + error_state_name       = (known after apply)
      + gcp_project_id         = (known after apply)
      + id                     = (known after apply)
      + network_name           = (known after apply)
      + peer_id                = (known after apply)
      + project_id             = "XXXXX"
      + provider_name          = "AWS"
      + resource_group_name    = (known after apply)
      + route_table_cidr_block = "XXXXX/16"
      + status                 = (known after apply)
      + status_name            = (known after apply)
      + vnet_name              = (known after apply)
      + vpc_id                 = "vpc-XXXXX"
    } 